//# DZ_Seminar1
// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

// Console.Write("Введите первое число: ");
// int firstNamber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int secondNamber = Convert.ToInt32(Console.ReadLine());
// if (firstNamber > secondNamber) 
// {
//     Console.WriteLine(firstNamber + " больше " + secondNamber);
// }
// else Console.WriteLine(firstNamber + " меньше " + secondNamber);

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// Console.Write("Введите первое число: ");
// int firstNamber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int secondNamber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число: ");
// int thirdNamber = Convert.ToInt32(Console.ReadLine());

// int max = 0;

// if (firstNamber > max) 
// {
//     max = firstNamber;
// }

// if (secondNamber > max) 
// {
//     max = secondNamber;
// }

// if (thirdNamber > max) 
// {
//     max = thirdNamber;
// }

// Console.WriteLine(max+ " является максимальным числом");


// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

// Console.Write("Введите целое число: ");
// int firstNamber = Convert.ToInt32(Console.ReadLine());

// if (firstNamber %2 == 0) 
// {
// Console.WriteLine(firstNamber + " четное ");
// }
// else Console.WriteLine(firstNamber + " нечетное ");